<?xml version="1.0" ?>
<net name="palm_detection_FP16" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1, 3, 192, 192" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_1/scale_copy" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 5, 5" offset="0" size="4800"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D/filter:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="2, 2" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d/Conv2D1/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="4800" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d/Conv2D1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d/Conv2D1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg/mul_" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="4864" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg_1/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Neg_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/Relu_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize:0,model_1/model/p_re_lu/add_model_1/model/p_re_lu/Relu_model_1/model/p_re_lu/Neg_1_model_1/model/p_re_lu/Relu_1_model_1/model/p_re_lu/mul_dequantize_prelu/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="depthwise/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 5, 5" offset="4928" size="1600"/>
			<output>
				<port id="0" precision="FP16" names="depthwise/filter_in:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model_1/model/depthwise_conv2d/depthwise1/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="6528" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/depthwise_conv2d/depthwise1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model_1/model/depthwise_conv2d/depthwise1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/depthwise_conv2d/depthwise1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Conv2D_1/filter" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="6592" size="2048"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_1/filter:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Conv2D_1" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_1/Conv2D1/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="8640" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_1/Conv2D1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_1/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_1/Conv2D1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model_1/model/add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/add/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg/mul_" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="8704" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg_1/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Neg_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/Relu_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize:0,model_1/model/p_re_lu_1/add_model_1/model/p_re_lu_1/Relu_model_1/model/p_re_lu_1/Neg_1_model_1/model/p_re_lu_1/Relu_1_model_1/model/p_re_lu_1/mul_dequantize_prelu/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="depthwise_1/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 5, 5" offset="8768" size="1600"/>
			<output>
				<port id="0" precision="FP16" names="depthwise_1/filter_in:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="depthwise_1" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model_1/model/depthwise_conv2d_1/depthwise1/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="6528" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/depthwise_conv2d_1/depthwise1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model_1/model/depthwise_conv2d_1/depthwise1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/depthwise_conv2d_1/depthwise1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv2D_2/filter" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="10368" size="2048"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_2/filter:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv2D_2" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_2:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_2/Conv2D1/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="12416" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_2/Conv2D1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_2/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_2/Conv2D1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model_1/model/add_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/add_1/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg/mul_" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="12480" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg_1/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Neg_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/Relu_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize:0,model_1/model/p_re_lu_2/add_model_1/model/p_re_lu_2/Relu_model_1/model/p_re_lu_2/Neg_1_model_1/model/p_re_lu_2/Relu_1_model_1/model/p_re_lu_2/mul_dequantize_prelu/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="depthwise_2/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 5, 5" offset="12544" size="1600"/>
			<output>
				<port id="0" precision="FP16" names="depthwise_2/filter_in:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="depthwise_2" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_2:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model_1/model/depthwise_conv2d_2/depthwise1/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="6528" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/depthwise_conv2d_2/depthwise1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="model_1/model/depthwise_conv2d_2/depthwise1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/depthwise_conv2d_2/depthwise1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv2D_3/filter" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="14144" size="2048"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_3/filter:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv2D_3" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_3/Conv2D1/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="16192" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_3/Conv2D1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_3/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_3/Conv2D1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="model_1/model/add_2/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/add_2/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Neg/mul_" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="16256" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Neg:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Neg_1/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Neg_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/Relu_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize:0,model_1/model/p_re_lu_3/add_model_1/model/p_re_lu_3/Relu_model_1/model/p_re_lu_3/Neg_1_model_1/model/p_re_lu_3/Relu_1_model_1/model/p_re_lu_3/mul_dequantize_prelu/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="depthwise_3/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 5, 5" offset="16320" size="1600"/>
			<output>
				<port id="0" precision="FP16" names="depthwise_3/filter_in:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="depthwise_3" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="model_1/model/depthwise_conv2d_3/depthwise1/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="6528" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/depthwise_conv2d_3/depthwise1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model_1/model/depthwise_conv2d_3/depthwise1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/depthwise_conv2d_3/depthwise1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv2D_4/filter" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="17920" size="2048"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_4/filter:0">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv2D_4" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="Conv2D_4:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_4/Conv2D1/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="19968" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_4/Conv2D1/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_4/Conv2D1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_4/depthwise_model_1/model/conv2d_4/Conv2D1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model_1/model/add_3/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/add_3/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/Relu:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/Neg/mul_" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="20032" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/Neg:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/Neg_1/mul_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/Neg_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/Relu_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize:0,model_1/model/p_re_lu_4/add_model_1/model/p_re_lu_4/Relu_model_1/model/p_re_lu_4/Neg_1_model_1/model/p_re_lu_4/Relu_1_model_1/model/p_re_lu_4/mul_dequantize_prelu/add:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model_1/model/max_pooling2d/MaxPool" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model_1/model/max_pooling2d/MaxPool:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="1105117123" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="20096" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="1105717387" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="20128" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="model_1/model/channel_padding/Pad/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="20160" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="75" name="model_1/model/channel_padding/Pad/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="76" name="model_1/model/channel_padding/Pad" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP16"/>
			</input>
			<output>
				<port id="4" precision="FP16" names="model_1/model/channel_padding/Pad:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="depthwise_4/filter_in" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 5, 5" offset="20162" size="1600"/>
			<output>
				<port id="0" precision="FP16" names="depthwise_4/filter_in:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="depthwise_4" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="2, 2" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="depthwise_4:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="model_1/model/depthwise_conv2d_4/depthwise2/y" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="6528" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_1/model/depthwise_conv2d_4/depthwise2/y:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model_1/model/depthwise_conv2d_4/depthwise2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model_1/model/depthwise_conv2d_4/depthwise2:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv2D_5/filter" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 1, 1" offset="21762" size="4096"/>
			<output>
				<port id="0" precision="FP16" names="Conv2D_5/filter:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv2D_5" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
